# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gnupg2'
brew 'hub' # github git wrapper
brew 'mas'
brew 'neovim'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'zsh'
brew 'atool'

# Apps
cask 'android-sdk'
cask 'android-studio'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'gpg-suite'
cask 'iTerm2'
cask 'intellij-idea-ce'
cask 'java8'
cask 'keybase'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'OneDrive', id: 823766827
mas 'Spark', id: 1176895641
mas 'telegram', id: 747648890

# fonts
cask 'font-fira-code'
