# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'mackup'
brew 'mas'
brew 'tree'
brew 'zsh'
brew 'neovim'
brew 'fasd'
brew 'fzf'
brew 'jq'
brew 'tmux'
brew 'the_silver_searcher'
brew 'vagrant'
brew 'trash'

# Apps
cask 'docker'
cask 'google-chrome'
cask 'gpg-suite'
cask 'java'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'android-sdk'
cask 'android-studio'
cask 'spotify'
cask 'sourcetree'
cask 'telegram'
cask 'intellij-idea'
cask 'keybase'
cask 'dash'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641
mas 'OneDrive', id: 823766827
