# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'coursier/formulas'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctags'
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'git'
brew 'ghc'
brew 'gnupg2'
brew 'mas' # Mac App Store command-line
brew 'nvm'
brew 'neovim', args: ['HEAD']
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'ripgrep'
brew 'vim'
brew 'zsh'
brew 'atool' # unzip tools
brew 'sbt' # Scala
brew 'coursier/formulas/coursier' # Pure scala artifact Fetching

# Apps
#cask 'android-sdk'
#cask 'android-studio'
#cask 'dash'
#cask 'intellij-idea-ce'
cask 'docker'
cask 'firefox-developer-edition'
cask 'gpg-suite'
cask 'iTerm2'
cask 'java8'
cask 'keybase'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'flux'

# Mac App Store
#mas 'Keynote', id: 409183694
mas 'OneDrive', id: 823766827
mas 'Spark', id: 1176895641
mas 'telegram', id: 747648890

# fonts
cask 'font-fira-code'
